{
	"cast":[
		{
			"safename":"walter",
			"name":"WALTER BLUNT",
			"actor":"Patrick Stewart",
			"icon":"camera.png",
			"quote":"a fool's mission is still a mission.",
			"desc":"Walter is a British ex-pat and Falklands War veteran, who currently finds himself riding the tumultuous waves of American cable news. Through his show &#8220;Blunt Talk,&#8221; he delivers hard-hitting truths to his American audience, while often struggling with his life behind the scenes."
		},{
			"safename":"harry",
			"name":"HARRY CHANDLER",
			"actor":"Adrian Scarborough",
			"icon":"sword.png",
			"quote":"i don't hate myself but i don't like myself. i hover somewhere in the middle.",
			"desc":"Harry is Walter's manservant, confidant, brother-in-arms, and best friend. He loves drinking and gambling, but neither of these match his unflinching loyalty to Walter."
		},{
			"safename":"rosalie",
			"name":"ROSALIE WINTER",
			"actor":"JACKI WEAVER",
			"icon":"onair.png",
			"quote":"i'm sorry to be the only sane person here, but this has fuck-up written all over it.",
			"desc":"Rosalie is Walter's executive producer. She oversees Walter and his eccentric staff with a mix of ferocity and tenderness. On the surface she is a bastion of strength, but underneath she's a vulnerable romantic who is becoming increasingly alarmed by the rapid changes in her home life."
		},{
			"safename":"celia",
			"name":"Celia Havemeyer",
			"actor":"Dolly Wells",
			"icon":"bra.png",
			"quote":"I have sex too easily and I always go for the ones who disappear. Also alcoholics. That's my other specialty.",
			"desc":"Celia is a senior producer of &#8220;Blunt Talk&#8221; keen on impressing Walter, whom she has admired for many years. However, to the detriment of her career, her impulsive spirit comes with a chaotic personal life."
		},{
			"safename":"jim",
			"name":"JIM STONE",
			"actor":"TIMM SHARP",
			"icon":"container.png",
			"quote":"i was wildly addicted. but i'm better now. sort of.",
			"desc":"Jim is a senior producer of &#8220;Blunt Talk.&#8221; He is an intellectual who does great work behind the camera, while hoping one day to be in front of it. As his dreams and desires emerge, so do a laundry list of neuroses that he must struggle to overcome."
		},{
			"safename":"martin",
			"name":"MARTIN BASSI",
			"actor":"KARAN SONI",
			"icon":"pills.png",
			"quote":"i like pointy boobs. you know, the ones that look like MAGICAL elf shoes.",
			"desc":"Martin, the runt of the litter, is a segment producer still struggling to fit in. As the daunting age of 28 looms over him, he seeks solace in the motherly embraces of Rosalie."
		},{
			"safename":"shelly",
			"name":"SHELLY FORBES",
			"actor":"Mary Holland",
			"icon":"shoe.png",
			"quote":"we all have bathroom issues.",
			"desc":"Despite only being a segment producer, Shelly is an eager firecracker, hell-bent on making her mark in the news world. She is aggressive in her professional life, constantly angling for an opportunity to move up the ladder, and equally aggressive in her sexually adventurous private life."
		},{
			"safename":"weiss",
			"name":"Dr. Weiss",
			"actor":"RICHARD LEWIS",
			"icon":"books.png",
			"quote":"Would you like to talk? Or do a line?",
			"desc":"Dr. Weiss is a therapist who purports to be a Freudian. He delves deep into the psyches of &#8220;Blunt Talk's&#8221; staff and is less than discreet with his findings."
		},{
			"safename":"bob",
			"name":"Bob Gardner",
			"actor":"Romany malco",
			"icon":"money.png",
			"quote":"BOB GIVETH, BOB TAKETH.",
			"desc":"Bob Gardner is Walter's boss and the current President of UBS Network. Although he's supportive of Walter, the only thing that matters to Gardner is ratings."
		}
	]
}